Revit 2026 API

# SolidCurveIntersectionGetCurveSegmentExtents Method

---

Gets the extents for the given curve segment generated by intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveExtents GetCurveSegmentExtents(
	int index
)
```
```vb
Public Function GetCurveSegmentExtents (
	index As Integer
) As CurveExtents
```
```cpp
public:
CurveExtents^ GetCurveSegmentExtents(
	int index
)
```
```fsharp
member GetCurveSegmentExtents :
        index : int -> CurveExtents
```

#### Parameters

index Int32
     The index.

#### Return Value

CurveExtents The curve extents.

| Exception | Condition |
| --- | --- |
| ArgumentException | index is out of range. |

The parameters are raw parameters based on the raw parameter extents of the original input curve.

#### Reference

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace